---
kind: method
id: M:Autodesk.Revit.DB.LineSegment.Dispose
source: html/fea89837-310d-f1cd-0026-90b6e9605149.htm
---
# Autodesk.Revit.DB.LineSegment.Dispose Method

Releases all resources used by the LineSegment

## Syntax (C#)
```csharp
public void Dispose()
```